START:

MVI H, LIGHT            ; Вчитај информацијата за локацијата на семафорот во регистарот H
MVI L, LOC                ; Вчитај информацијата за локацијата на семафорот во регистарот L
MOV A, M                  ; Прочитај ја состојбата од ROM (претпоставувајќи дека ROM-от ја содржи почетното состојба)
OUT PORT A              ; Прикажи ја состојбата на одговарачкиот I/O порт за контрола на семафорите
CALL DOCNI_1MIN   ; Задоцни за 1 минута

INX H                   ; Префрли се на следната ло
MOV A, M             ; Прикажи ја следната состојба од ROM
OUT PORT A ; Излези ја следната состојба за контрола на семафорите
CALL DOCNI_3SEC ; Задоцни за 3 секунди

	         ; Дополнителни инструкции (влез и излез на следни состојби)

MOV A, M                     ; Прочитај ја следната состојба од ROM
OUT PORT A                ; Прикажи ја следната состојба за контрола на семафорите
CALL DOCNI_3SEC     ; Задоцни за 3 секунди
JMP START                  ; Скокни назад на почетокот за да продолжи
END